'''
PYTHON2025 2학기 컴공 4장 문제3
#소스코드 한글지원 안됩니다.

#--------------------------------------------------------------------------------------------------------------------------------------------------------------------------

사용자로부터 알파벳 문자 하나를 입력 받아서 a, e, i, o, u일 경우 '모음입니다.'를, 이외의 문자일 경우 '자음입니다.'를 출력하시오.

#'모음입니다.' --> 'is a vowel.'
#'자음입니다.'--> 'is a consonant.'
#--------------------------------------------------------------------------------------------------------------------------------------------------------------------------

실행 결과 예시 1:
Input an alphabet: a
"a" is a vowel.

실행 결과 예시 2:
Input an alphabet: t
"t" is a consonant.
'''

c = input("Input an alphabet: ")

if c == 'a' or c == 'e' or c == 'i' or c == 'o' or c == 'u':
    print(f"\"{c}\" is a vowel.")
else :
    print(f"\"{c}\" is a consonant.")